blog/2016-08-02-dhcp.org
#+TITLE: DHCP和PXE
#+DATE: 2016-08-02
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 网络
#+JEKYLL_TAGS: Linux 运维 网络
#+JEKYLL_PUBLISHED: true

TODO




-----
* DHCP
DHCP: Dynamic Host Configuration Protocol
** DHCP交互步骤
1. Client: dhcp discover(广播)
2. Server: dhcp offer(IP/netmask, gw)
3. Client：dhcp request
4. Server: dhcp ack
** DHCP续租步骤
1. Client: dhcp request(单播)
2. Server: dhcp ack/nak
** DHCP服务
*** DHCP服务端
- /usr/sbin/dhcpd: ipv4的DHCP
  - 配置文件: /etc/dhcp/dhcpd.conf
  - 地址分配记录文件: /var/lib/dhcpd/dhcpd.leases
- /usr/sbin/dhcp6: ipv6的DHCP
  - 配置文件: /etc/dhcp/dhcpd6.conf 
- /usr/sbin/dhcrelay
- 监听端口: 67/udp
*** DHCP客户端
- /usr/sbin/dhclient
- 监听端口: 68/udp
** dhcpd.conf配置
#+BEGIN_SRC conf
# option用于定义传输给客户端的数据，可在subnet中特殊定义
option domain-name "magedu.com"  # 定义搜索域
option domain-name-servers "DNS_IP", "DNS_IP";  # 定义DNS

default-lease-time 600;  # 默认地址租约时间
max-lease-time 7200;  # 最大地址租约时间

log-facility local7;  # 定义日志类型

subnet 172.16.0.0 netmask 255.255.0.0 {  # 定义一个子网
    range 172.16.100.151 172.16.100.170;  # 定义地址池
    option routers 172.16.100.1;  # 定义网关

    filename "pxelinux.0";  # 指定PXE引导文件名称
    next-server 172.16.100.67;  # 提供PXE引导文件的服务器IP地址
}

host {  # 定义固定地址
    ...
}
#+END_SRC
* PXE
PXE：preboot execute environment，可用于网卡启动和安装系统

** PXE的准备
- DHCP: 配置好filename和next-server
- tftp
- file server(yum repository)

** tftp服务器配置
- 配置tftp
  #+BEGIN_SRC conf
  yum -y install syslinux tftp-server
  
  cp /usr/share/syslinux/pxelinux.0 /var/lib/tftpboot/
  cp /media/cdrom/images/pxelinux/{vmlinuz,initrd.img} /var/lib/tftpboot/
  # cp /media/cdrom/isolinux/{boot.cfg,vesamenu.c32,splash.png} /var/lib/tftpboot/
  cp /usr/share/syslinux/{chain.c32,mboot.c32,menu.c32,memdisk} /var/lib/tftpboot/
  
  mkdir /var/lib/tftpboot/pxelinux.cfg/
  # cp /media/cdrom/isolinux/isolinux.cfg /var/lib/tftpboot/pxelinux.cfg/default
  # 在该文件的APPEND下添加参数 inst.repo=http://172.16.100.67/centos7 ks=http://172.16.100.67/centos7.cfg 实现远程安装，该文件也可以自定义
  touch /var/lib/tftpboot/pxelinux.cfg/default
  
  systemctl start tftp.service
  #+END_SRC

- 自定义创建的default文件
  #+BEGIN_SRC conf
  default menu.c32
  prompt 0
  timeout 30
  MENU TITLE CentOS 7 PXE Menu 

  LABEL linux
    MENU LABEL Install CentOS 7 x86_64
    KERNEL vmlinuz
    APPEND initrd=initrd.img inst.repo=http://172.16.100.67/centos7 ks=http://172.16.100.67/centos7.cfg
#+END_SRC

** file server配置
将光盘挂载至httpd目录下，同时复制KS文件到httpd目录下，改变其url地址指向光盘挂载的文件夹
